In [1]:
import pandas as pd
import matplotlib.pyplot as plt

df= pd.read_csv('data/bank_transactions_data_2.csv')

### Returns the average amount taken from the bank's customers

In [9]:
#Code Here Samara
avg_amount=df['TransactionAmount']
print(f'The average amount taken from the customers is ${avg_amount.mean():.2f}')

The average amount taken from the customers is $297.59

In [11]:
df.head()

,TransactionID,AccountID,TransactionAmount,TransactionDate,TransactionType,Location,DeviceID,IP Address,MerchantID,Channel,CustomerAge,CustomerOccupation,TransactionDuration,LoginAttempts,AccountBalance,PreviousTransactionDate
0,TX000001,AC00128,14.09,2023-04-11 16:29:14,Debit,San Diego,D000380,162.198.218.92,M015,ATM,70,Doctor,81,1,5112.21,2024-11-04 08:08:08
1,TX000002,AC00455,376.24,2023-06-27 16:44:19,Debit,Houston,D000051,13.149.61.4,M052,ATM,68,Doctor,141,1,13758.91,2024-11-04 08:09:35
2,TX000003,AC00019,126.29,2023-07-10 18:16:08,Debit,Mesa,D000235,215.97.143.157,M009,Online,19,Student,56,1,1122.35,2024-11-04 08:07:04
3,TX000004,AC00070,184.50,2023-05-05 16:32:11,Debit,Raleigh,D000187,200.13.225.150,M002,Online,26,Student,25,1,8569.06,2024-11-04 08:09:06
4,TX000005,AC00411,13.45,2023-10-16 17:51:24,Credit,Atlanta,D000308,65.164.3.100,M091,Online,26,Student,198,1,7429.40,2024-11-04 08:06:39

### Returns the average amount for the transactions for each credit and debit

In [16]:
#code here Samara 
average_amounts = df.groupby('TransactionType')['TransactionAmount'].mean()
print("The average amount for each credit and debit:")
print(average_amounts)
print()
print(df['TransactionType'].value_counts())

The average amount for each credit and debit:
TransactionType
Credit    306.501004
Debit     294.991255
Name: TransactionAmount, dtype: float64

TransactionType
Debit     1944
Credit     568
Name: count, dtype: int64

### United States cities which were most and least effected

In [24]:
#code here Samara
cities_effected=df['Location'].value_counts()
print('Top 5 cities most effected')
print(cities_effected.head())
print()
print('Least 5 cities effected')
print(cities_effected.tail())

Top 5 cities most effected
Location
Fort Worth       70
Los Angeles      69
Oklahoma City    68
Charlotte        68
Tucson           67
Name: count, dtype: int64

Least 5 cities effected
Location
Dallas         49
Washington     48
El Paso        46
Portland       42
Albuquerque    41
Name: count, dtype: int64

###  How many of these transactions changed locations after a withdrawal

In [ ]:
#code here

### Returns  the average account balance ,before any fraudelent transaction was made

In [ ]:
#code here

### Occupation trends?

In [ ]:
#code here

### What was the oldest, youngest, and average age of the Victims

In [ ]:
#code here

###  What were the more transactions taken from the ATM, online, or branch

In [29]:
#code here Samara
channel_type=df['Channel'].value_counts()
print(channel_type)

Channel
Branch    868
ATM       833
Online    811
Name: count, dtype: int64

### What was the average for each ATM, online, and branch transaction

In [35]:
#code here Samara
Channel_avg= df.groupby('Channel')['TransactionAmount'].mean()
print(Channel_avg.round(2))

Channel
ATM       307.72
Branch    288.23
Online    297.21
Name: TransactionAmount, dtype: float64

### What was the average time in which these transactions lasted

In [ ]:
#code here

### What was the average number of login attempts made before the transaction

In [ ]:
#code here